{
  "meta": {
    "colors": {
      "primary": "#2196f3",
      "secondary": "#64B5F6",
      "accent": "#D50000"
    }
  },
  "basics": {
    "name": "Luke Davis",
    "label": "Software Developer",
    "picture": "luke_davis_profile.png",
    "email": "lpdavis13@gmail.com",
    "emailIcon": "ic_email_white.png",
    "phone": "(740)334-8424",
    "phoneIcon": "ic_phone_iphone_white.png",
    "website": "http://lucky13.technology",
    "websiteIcon": "ic_link_white.png",
    "summary": "Self-driven individual with unmatched passion to solve business needs utilizing new technologies while continuing to hone software craftsmanship",
    "about": "My interest in technology started as far back as I can remember. I was the type of kid that would ask for a Walkman and have it disassembled in a matter of minutes, just to see how it worked. I wrote my first program in a high school robotics class. From that moment on I have been fascinated with electronics, software, and connecting the two together. After graduating high school, I decided to go straight into a career path. A great area, which I felt, was a blend of both areas of interest would be working as an electrician. I spent the next 12 years working, primarily on, commercial and industrial electrical installation projects. The projects ranged anywhere from automated lighting systems to industrial scale recycling automation. About 8 years into my career, as an electrician, I felt that I needed to take myself to the next level and focus more on the software aspect. So, I went back to school full-time. Directly out of college I got a job with an insurance company as a developer. This was about the same time as the advent of smart phones. After my first mobile project I found myself very attracted to developing on mobile platforms. The primary reason being it is an intimate technology where we, as developers, get the opportunity to directly impact a user's life. I have since worked on many iOS and Android projects, most recently and notably the Wendy's Mobile Ordering application. Throughout the years I have worked on many aspects of the technology stack ranging from Bluetooth 4 to back-end services and databases. In my free time I like developing anything IoT related, wood working, traveling, hiking, and spending time with my family.",
    "location": {
      "address": "227 E Street",
      "postalCode": "94063",
      "city": "Redwood City",
      "countryCode": "US",
      "region": "California",
      "icon": "ic_location_on_white.png"
    },
    "profiles": [{
      "network": "LinkedIn",
      "username": "lpdavis",
      "url": "https://www.linkedin.com/in/lpdavis/",
      "icon": "LinkedIn_white.png"
    },{
      "network": "Github",
      "username": "spookyd",
      "url": "https://github.com/spookyd",
      "icon": "GitHub-Mark_white.png"
    }]
  },
  "work": [{ 
    "company": "ZeeMee",
    "position": "Senior iOS Engineer",
    "location": "Redwood City, CA",
    "website": "https://www.zeemee.com",
    "startDate": "11/2017",
    "endDate": "present",
    "summary": "Senior engineer on a small iOS team providing technical support and new features for ZeeMee’s mobile application.",
    "highlights": [
      "Identified UI performance bottlenecks and executed plan of action to improve video feed",
      "Designed and implemented routing system allowing for flexible navigation within the application as well as through deep links",
      "Integrated a custom ejabberd client, enabling live communications directly within the application",
      "Collaborated with design team to create pixel perfect custom photo library, video recorder and video editor"
    ]
  },{
    "company": "Lucky 13 Technologies, LLC.",
    "position": "Owner, Lead Developer",
    "location": "Columbus, OH",
    "website": "http://lucky13.technology",
    "startDate": "10/2014",
    "endDate": "present",
    "summary": "Partnering with software firms to build custom mobile applications and backend services.",
    "highlights": [
      "Weigl Works - Designed and implemented AppKit UI components for a show control MacOS application",
      "Scotts® - Developed a custom Android based door to door sales app, which allowed for card present credit card transactions",
      "Bold Penguin - Created an API only Rails 5 application used for an insurance eligibility rules engine",
      "Tap by Lucky 13 - Personal iOS productivity app, written in Swift and uses ReSwift for unidirectional data flow"
    ]
  },{
    "company": "The Wendy’s Company",
    "position": "Lead Mobile Application Architect, eCommerce",
    "location": "Columbus, OH",
    "website": "http://wendys.com",
    "startDate": "06/2015",
    "endDate": "07/2017",
    "summary": "Lead engineer on the Wendy's eCommerce Application Development team with primary focus on the iOS and Android platforms.",
    "highlights": [
      "Led refactor of the Wendy's iOS app, converting from a singular Objective C code base to Swift modules, resulting in a 1438% decrease in reported bugs",
      "Guided Junior and Core members in TDD practices, resulting in a code coverage increase from 6% to 75%",
      "Collaborated directly with UX team to ensure a unified and polished product",
      "Created an internal iOS application used for debugging Bluetooth Beacon installations within restaurants"
    ]
  },{
    "company": "The Wendy’s Company",
    "position": "Senior Application Developer, eCommerce",
    "location": "Columbus, OH",
    "website": "http://wendys.com",
    "startDate": "11/2014",
    "endDate": "06/2015",
    "summary": "Original member of the Wendy’s Company innovation center, 90º Labs.",
    "highlights": [
      "Instrumental in the development and launch of the Wendy’s iOS mobile ordering application; written in Objective C",
      "Created custom scripts for both App Store and Enterprise application deployments using Jenkins jobs",
      "Developed an automatic order fulfillment framework using Swift, Core Bluetooth and Core Location, providing mobile users with a unique restaurant experience",
      "Instrumental in the development of the product foundation, CI, and Automation Scripts to support the new iOS, Android, and Web applications; https://itunes.apple.com/us/app/wendys/id540518599?mt=8, https://play.google.com/store/apps/details?id=com.wendys.nutritiontool&hl=en"
    ]
  },{
    "company": "Leading EDJE, LLC.",
    "position": "Solutions Developer",
    "location": "Columbus, OH",
    "website": "http://leadingedje.com/",
    "startDate": "02/2013",
    "endDate": "11/2014",
    "summary": "Member of solutions delivery team, providing expertise in custom application development and unique business solutions.",
    "highlights": [
      "Crown Infolink®(http://www.crown.com/en-us/fleet-management/infolink.html) - Built fork lift management solution using Android for client and Java technologies to expose HTTP endpoints",
      "DSW - Performed security audit, based on OWASP for mobile guidelines, for DSW’s eCommerce iOS application"
    ]
  },{
    "company": "Motorists Insurance Group",
    "position": "Developer",
    "location": "Columbus, OH",
    "website": "https://www.motoristsinsurancegroup.com/who-we-are/affiliates/motorists-mutual",
    "startDate": "06/2011",
    "endDate": "02/2013",
    "summary": "Developed and supported new features for existing home and life insurance agent portals, as well as the Motorists Insurance mobile application project.",
    "highlights": [
      "Mentored in Android and iOS development, testing, and deployment for the Motorists Insurance mobile applications https://itunes.apple.com/us/app/motorists-mutual-mobile/id503935355?mt=8, https://play.google.com/store/apps/details?id=com.motorists&hl=en"
    ]
  },{
    "company": "DesignLinx, LLC.",
    "position": "Founder/ Lead Developer",
    "location": "Newark, OH",
    "website": "",
    "startDate": "2011",
    "endDate": "2013",
    "summary": "Founder of an interactive wedding planning website, WeddingLinx, which connected DIY wedding planners with vendors.",
    "highlights": [
    ]
  },{
    "company": "Goodin Electric",
    "position": "Electrical Journeyman, Foreman",
    "location": "Newark, OH",
    "website": "http://www.goodinelectric.com/",
    "startDate": "2000",
    "endDate": "2012",
    "summary": "Lead foreman on over 20 commercial and industrial projects, with varying environments, team sizes and complexities.",
    "highlights": [
    ]
  }],
  "education": [{
    "institution": "DeVry University",
    "area": "Computer Engineering Technologies",
    "studyType": "Bachelor of Science",
    "startDate": "06/2007",
    "endDate": "07/2011",
    "location": "Columbus, OH",
    "gpa": "3.96"
  }],
  "certifications": [{
    "title": "Professional Scrum Master™ level I (PSM I)",
    "date": "08/18/2014",
    "awarder": "Scrum.org",
    "summary": "People who have passed PSM I, achieving certification, demonstrate a fundamental level of Scrum mastery. PSM I certificate holders prove that they understand Scrum as described in the Scrum Guide and the concepts of applying Scrum.  PSM I holders have a consistent terminology and approach to Scrum."
  },{
    "title": "Professional Scrum Developer™ (PSD)",
    "date": "08/16/2013",
    "awarder": "Scrum.org",
    "summary": "The Professional Scrum Developer™ (PSD) assessment is available to anyone who wishes to validate their knowledge of how to build complex software products using Scrum. Those that pass the assessment will receive the industry recognized PSD Certification to demonstrate their mastery of the content."
  },{
    "title": "OCPJP (Oracle Certified Professional Java Programmer)",
    "date": "07/19/2013",
    "awarder": "Oracle",
    "summary": "An Oracle Certified Professional, Java SE 6 Programmer has experience using the Java programming language, understands the basic syntax and structure of the Java programming language and can create Java technology applications that run on server and desktop systems using J2SE 6.0."
  }],
  "awards": {
    "title": "The \"Do the Right Thing\" award",
    "date": "2015",
    "awarder": "The Wendy's Company",
    "summary": ""
  },
  "skills": [{
    "name": "Programming Languages",
    "level": "Proficient",
    "keywords": [
      "Swift 4",
      "Objective C",
      "Java",
      "Ruby"
    ]
  },{
    "name": "iOS Frameworks",
    "level": "Proficient",
    "keywords": [
      "UIKit",
      "AVFoundation",
      "CoreLocation",
      "GCD",
      "CoreBluetooth",
      "CoreData"
    ]
  },{
    "name": "Third Party Libraries",
    "level": "Proficient",
    "keywords": [
      "Apollo-ios",
      "JSQMessageViewController",
      "Alamofire",
      "AlamofireImage",
      "XMPP Framework",
      "Lottie-ios"
    ]
  },{
    "name": "Network",
    "level": "Proficient",
    "keywords": [
      "REST",
      "GraphQL",
      "JSON",
      "XML"
    ]
  },{
    "name": "Persistence",
    "level": "Proficient",
    "keywords": [
      "SQLite",
      "Postgres",
      "MySQL",
      "MongoDB"
    ]
  },{
    "name": "Testing",
    "level": "Proficient",
    "keywords": [
      "XCTest",
      "Quick",
      "Nimble",
      "Cucumber",
      "RSpec"
    ]
  },{
    "name": "Development Tools",
    "level": "Proficient",
    "keywords": [
      "Xcode",
      "AppCode",
      "Carthage",
      "CocoaPods"
    ]
  },{
    "name": "Clean Code",
    "level": "Master",
    "keywords": [
      "SwiftLint",
      "Object Oriented Design",
      "SOLID",
      "Protocol Oriented Design",
      "TDD/BDD"
    ]
  },{
    "name": "Additional Proficiencies",
    "level": "Proficient",
    "keywords": [
      "Git",
      "Scrum",
      "Jenkins",
      "Travis CI",
      "Markdown",
      "Rake",
      "Make"
    ]
  }],
  "languages": [{
    "name": "English",
    "level": "Native speaker"
  }],
  "interests": [{
    "name": "IoT",
    "keywords": [
      "Bluetooth 4+",
      "Raspberry Pi",
      "Node Red",
      "Arduino"
    ]
  },{
    "name": "Travel",
    "keywords": [
      "Hiking",
      "Kayaking",
      "Food",
      "Culture"
    ]
  },{
    "name": "Music",
    "keywords": [
      "Guitar",
      "Keyboard",
      "Theory"
    ]
  },{
    "name": "Other",
    "keywords": [
      "Woodworking",
      "iOS Development"
    ]
  }]
}
